<?php
header('Content-type: text/html; charset=UTF-8');
/*3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:
Московская область:
Москва, Зеленоград, Клин
Ленинградская область:
Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область … (названия городов можно найти на maps.yandex.ru)*/

$cities = [
  'Московская область' => [
    "Апрелевка", "Балашиха", "Бронницы", "Верея", "Видное", "Волоколамск", "Воскресенск",
    "Высоковск", "Голицыно", "Дедовск", "Дзержинский", "Дмитров", "Долгопрудный", "Домодедово",
    "Дрезна", "Дубна", "Егорьевск", "Жуковский", "Зарайск", "Звенигород", "Ивантеевка", "Истра",
    "Кашира", "Клин", "Коломна", "Королёв", "Котельники", "Красноармейск", "Красногорск",
    "Краснозаводск", "Краснознаменск", "Кубинка", "Куровское", "Ликино-Дулёво", "Лобня",
    "Лосино-Петровский", "Луховицы", "Лыткарино", "Люберцы", "Можайск", "Мытищи", "Наро-Фоминск",
    "Ногинск", "Одинцово", "Озёры", "Орехово-Зуево", "Павловский Посад", "Пересвет", "Подольск",
    "Протвино", "Пушкино", "Пущино", "Раменское", "Реутов", "Рошаль", "Руза", "Сергиев Посад",
    "Серпухов", "Солнечногорск", "Старая Купавна", "Ступино", "Талдом", "Фрязино", "Химки",
    "Хотьково", "Черноголовка", "Чехов", "Шатура", "Щёлково", "Электрогорск", "Электросталь",
    "Электроугли", "Яхрома"
  ],
  'Владимирская область' => [
    "Александров", "Владимир", "Вязники", "Гороховец", "Гусь-Хрустальный", "Камешково",
    "Карабаново", "Киржач", "Ковров", "Кольчугино", "Костерёво", "Курлово", "Лакинск",
    "Меленки", "Муром", "Петушки", "Покров", "Радужный", "Собинка", "Струнино", "Судогда",
    "Суздаль", "Юрьев-Польский"
  ],
  'Ивановская область' => [
    "Вичуга", "Гаврилов Посад", "Заволжск", "Иваново", "Кинешма", "Комсомольск", "Кохма",
    "Наволоки", "Плёс", "Приволжск", "Пучеж", "Родники", "Тейково", "Фурманов", "Шуя", "Южа",
    "Юрьевец"
  ],
  'Калининградская область' => [
    "Багратионовск", "Балтийск", "Гвардейск", "Гурьевск", "Гусев", "Зеленоградск",
    "Калининград", "Краснознаменск", "Ладушкин", "Мамоново", "Неман", "Нестеров", "Озёрск",
    "Пионерский", "Полесск", "Правдинск", "Приморск", "Светлогорск", "Светлый", "Славск",
    "Советск", "Черняховск"
  ]
];

echo '<br>Задание 3<br><br>';


foreach ($cities as $obl => $names) {
  $namesString = implode(', ', $names);
  echo "{$obl}:<br>{$namesString}<br>";
}

echo '<br>Задание 8<br><br>';
//8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».

foreach ($cities as $obl => $names) {
  echo "{$obl}:<br>";
  foreach ($names as $name) {
    if (mb_substr($name, 0, 1) == 'К') {
      echo $name . ', ';
    }
  }
  echo '<br>';
}
